In [1]:
import pandas as pd

In [10]:
indian_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "temp" : [23,37,30],
    "humidirty" : [89,70,65]
}
)
us_weather = pd.DataFrame({
    "city" : ["new york","chicago","orlango"],
    "temp" : [13,34,23],
    "humidirty" : [81,72,45]
}
)

In [13]:
df = pd.merge(indian_weather,us_weather,on = "temp")
df
### merge on the besis of temp , where temp values are same for these 2 data frame it merge these 2 data frame

   city_x  temp  humidirty_x   city_y  humidirty_y
0  mumbai    23           89  orlango           45

In [28]:
indian_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore","balimore","oslo"],
    "humidirty" : [89,70,65,87,45]
}
)
us_weather = pd.DataFrame({
    "city" : ["delhi","banglore","mumbai","haldia"],
    "temp" : [13,34,23,787],
}
)

### inner join(default)

In [29]:
df = pd.merge(indian_weather,us_weather,on = "city")
df
### merge perform inner join

       city  humidirty  temp
0    mumbai         89    23
1     delhi         70    13
2  banglore         65    34

### outer join

In [ ]:
df = pd.merge(indian_weather,us_weather,on = "city",how = "outer")
df

       city  humidirty   temp
0  balimore       87.0    NaN
1  banglore       65.0   34.0
2     delhi       70.0   13.0
3    haldia        NaN  787.0
4    mumbai       89.0   23.0
5      oslo       45.0    NaN

### know in which data frame the data belongs to

In [31]:
df = pd.merge(indian_weather,us_weather,on = "city",how = "outer",indicator= True)
df

       city  humidirty   temp      _merge
0  balimore       87.0    NaN   left_only
1  banglore       65.0   34.0        both
2     delhi       70.0   13.0        both
3    haldia        NaN  787.0  right_only
4    mumbai       89.0   23.0        both
5      oslo       45.0    NaN   left_only

In [32]:

indian_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "temp" : [23,37,30],
    "humidirty" : [89,70,65]
}
)
us_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "temp" : [13,34,23],
    "humidirty" : [81,72,45]
}
)

In [35]:
df = pd.merge(indian_weather,us_weather,on = "city" , how = "outer" , indicator=True , suffixes=("_left_table","_right_table"))
df

,city,temp_left_table,humidirty_left_table,temp_right_table,humidirty_right_table,_merge
0,banglore,30,65,23,45,both
1,delhi,37,70,34,72,both
2,mumbai,23,89,13,81,both